/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50702
Source Host           : localhost:3306
Source Database       : mysql

Target Server Type    : MYSQL
Target Server Version : 50702
File Encoding         : 65001

Date: 2016-05-11 22:42:46
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `t_o_admin`
-- ----------------------------
DROP TABLE IF EXISTS `t_o_admin`;
CREATE TABLE `t_o_admin` (
  `o_adminId` int(10) NOT NULL AUTO_INCREMENT,
  `o_adminName` char(255) NOT NULL,
  `o_adminPwd` char(255) NOT NULL,
  UNIQUE KEY `o_adminId` (`o_adminId`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_o_admin
-- ----------------------------
INSERT INTO `t_o_admin` VALUES ('1', 'duzhuoting', '123');
INSERT INTO `t_o_admin` VALUES ('2', 'heboxin', '123');
INSERT INTO `t_o_admin` VALUES ('3', 'heboxin', '123');
INSERT INTO `t_o_admin` VALUES ('4', 'admin', 'asd');

-- ----------------------------
-- Table structure for `t_o_com`
-- ----------------------------
DROP TABLE IF EXISTS `t_o_com`;
CREATE TABLE `t_o_com` (
  `o_cId` int(10) NOT NULL AUTO_INCREMENT,
  `o_cNo` char(10) DEFAULT NULL,
  `o_cTitle` char(50) DEFAULT NULL,
  `o_cType` char(10) DEFAULT NULL,
  `o_cDate` timestamp NULL DEFAULT NULL,
  `o_cContent` text,
  UNIQUE KEY `o_cId` (`o_cId`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_o_com
-- ----------------------------
INSERT INTO `t_o_com` VALUES ('28', 'COM3599575', '关于美食与健康', '消息', '2016-05-06 00:00:00', '<p>①补钙要多吃含钙的食品，是含钙最丰富的食品莫过于乳制品。此外，像虾皮、海带、大豆、干酪、酸奶、杏仁、果仁、鱼子酱中含钙也十分丰富。新鲜的深色绿叶蔬菜中如油菜、 芹菜、菠菜含钙也多。 ②补钙同时需要维生素 D 的参与，因为维生素 D 能促进钙剂吸收进入血液。阳光可参与制造维生素 D，经常进行户外阳光下活动可以增强维生素 D 的合成和吸收，有助于钙的吸收和利用。另外，进行体育锻炼可以强筋骨改善骨骼的血液循环，增强骨密度。所以阳光和运 动有助于骨质疏松的预防，即使不能行走的人也应该尝试着每日到室外坐几分钟。 ③不饮酒，戒烟，尽量少喝咖啡，因为这些会影响钙的吸收和利用。 ④不要长期服用可引起骨质疏松的药物，如肝素、还有可的松、泼尼松龙等糖皮质激素。</p>');
INSERT INTO `t_o_com` VALUES ('29', 'COM6025032', '你的胃好吗', '消息', '2016-05-07 00:00:00', '①补钙要多吃含钙的食品，是含钙最丰富的食品莫过于乳制品。此外，像虾皮、海带、大豆、干酪、酸奶、杏仁、果仁、鱼子酱中含钙也十分丰富。新鲜的深色绿叶蔬菜中如油菜、 芹菜、菠菜含钙也多。\r\n②补钙同时需要维生素 D 的参与，因为维生素 D 能促进钙剂吸收进入血液。阳光可参与制造维生素 D，经常进行户外阳光下活动可以增强维生素 D 的合成和吸收，有助于钙的吸收和利用。另外，进行体育锻炼可以强筋骨改善骨骼的血液循环，增强骨密度。所以阳光和运 动有助于骨质疏松的预防，即使不能行走的人也应该尝试着每日到室外坐几分钟。\r\n③不饮酒，戒烟，尽量少喝咖啡，因为这些会影响钙的吸收和利用。\r\n④不要长期服用可引起骨质疏松的药物，如肝素、还有可的松、泼尼松龙等糖皮质激素。');

-- ----------------------------
-- Table structure for `t_o_food`
-- ----------------------------
DROP TABLE IF EXISTS `t_o_food`;
CREATE TABLE `t_o_food` (
  `o_foodId` int(10) NOT NULL AUTO_INCREMENT,
  `o_foodNo` char(10) NOT NULL,
  `o_foodName` char(50) NOT NULL,
  `o_foodType` char(50) DEFAULT NULL,
  `o_foodPrice` float DEFAULT NULL,
  `o_foodCook` char(50) DEFAULT NULL,
  `o_foodSynopsis` text,
  `o_foodRemark` text,
  UNIQUE KEY `o_foodId` (`o_foodId`)
) ENGINE=InnoDB AUTO_INCREMENT=72 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_o_food
-- ----------------------------
INSERT INTO `t_o_food` VALUES ('5', 'FOOD199414', '菜脯', '小吃', '20', '李厨师', '选用地产萝卜，配食盐，经传统腌晒而成，是潮汕地区居家佐餐的传统小菜，口感香脆，是佐餐和馈赠亲友之佳品。', '');
INSERT INTO `t_o_food` VALUES ('14', 'FOOD821850', '母油船鸭', '中餐', '88', '李厨师', '苏州船宴素享盛名，这母游船鸭便是其中的佼佼者。整只鸭子走油后，放入香菇、冬笋、猪肉丝等辅料，浇入苏州著名的母油（选优质酱油从三伏晒制到秋天后，挑其中最好的一层“母油”），在砂锅中煨制而成，原汁原味，香飘十里。菜的色面更是好看，酱红的鸭子，雪白的冬笋，粉红的猪肉，乌黑的香菇，碧绿的青菜。\r\n\r\n推荐品尝地：得月楼\r\n\r\n品尝法门：这道菜的口感，以“肥而不腻，淡而不薄，清而不寡，酥烂脱骨而不失其形”为最佳。\r\n', '');
INSERT INTO `t_o_food` VALUES ('15', 'FOOD209711', '梅花糕', '小吃', '3', '李厨师', '在眼花缭乱的数十种糕团中，朵朵似梅花绽开的梅花糕，只需一眼就能辨认出来。内注豆沙、鲜肉、玫瑰等各种馅心，面上撒满红绿丝和瓜子仁。细心的糕点师傅一边放在小纸上递给你，一边好心叮嘱“慢慢咬，小心不要在嘴里烫出个泡来”。\r\n\r\n品尝法门：吃在嘴里是带一点发了酵的面浆酸味，而这正是真味所在。\r\n', '');
INSERT INTO `t_o_food` VALUES ('16', 'FOOD327953', '苏式鲜肉月饼', '糕点', '5', '李厨师', '南方人少有不爱苏式月饼的，看起来金黄油润，吃起来皮层酥松，口味甜咸多样。甜馅料有松子仁、核桃仁、玫瑰花、赤豆等；咸馅料有火腿、虾仁、香葱等。其中惹最多人回味无穷的，恐怕还是鲜肉月饼。老字号的摊位前，常年都能见到等待月饼出炉的队伍，中秋佳节更是供不应求。\r\n\r\n推荐餐厅：胥城大厦\r\n\r\n品尝法门：最要紧是皮薄馅大，酥层清晰不乱。胥城的鲜肉月饼，皮重30克，馅重35克，卤汁浓郁，全手工制作。\r\n', '');
INSERT INTO `t_o_food` VALUES ('17', 'FOOD264593', '蔬菜冷汤', '招牌菜', '4', '李厨师', '蔬菜冷汤是安达鲁西亚地区极受欢迎的夏令菜，在炎炎夏日里食用具有消暑作用。\r\n', '');
INSERT INTO `t_o_food` VALUES ('18', 'FOOD889706', '马德里烩菜', '西餐', '56', '李厨师', '马德里烩菜是马德里最有代表性的菜肴，这是一种将豌豆、土豆、胡萝卜、芹菜或者卷心菜混在一起，放上牛肉、猪肉或者其他杂肉一起长时间焖煮，焖到菜和肉不分彼此，成为粘稠的肉汤为止，十分美味。\r\n', '');
INSERT INTO `t_o_food` VALUES ('19', 'FOOD723739', '黑脚猪生火腿', '西餐', '73', '李厨师', ' 整根连蹄带骨的生火腿是西班牙最美味的美食特产，更是这个大男人主义风行的国家最强烈的象征图腾。西班牙人嗜吃生火腿，品级当然也相差很多，所谓的 “火腿Jamón”指的是后腿，“前腿Paletta”的肉少，肉质较硬。一般常见的是“山火腿Jamón Serrano”，用一般的白猪腿腌过后风干制成，比较高级的山火腿经一年多的风干陈年，味道丰富相当好吃。 ', '');
INSERT INTO `t_o_food` VALUES ('20', 'FOOD360292', '明星鸭胸', '西餐', '34', '李厨师', '从国外进口的鸭胸用香草、红酒腌制后，放入微波炉烤制20分钟，约七成熟最好（此时鸭肉最滑嫩）。然后，再浇上法国苹果醋调出来的公主汁，将鸭胸的美味发挥到极致。\r\n', '');
INSERT INTO `t_o_food` VALUES ('21', 'FOOD235102', '香草羊扒', '西餐', '34', '李厨师', '将进口羊扒用多种法国香草与奶油腌好，然后，将羊扒煎香，外裹上法国红波芝士，使得原本肉质清香的扒肉味道更加香浓。', '');
INSERT INTO `t_o_food` VALUES ('22', 'FOOD692460', '肉眼扒', '西餐', '34', '李厨师', '选用的是最有名的美国牛肉肉眼扒。将肉眼扒烤至五分熟后，将汁多丰满的扒肉放入牛肉的绝配－－红酒中腌制，最后浇上黑椒汁而成。', '');
INSERT INTO `t_o_food` VALUES ('23', 'FOOD684672', '北京烤鸭', '中餐', '23', '李厨师', '北京烤鸭是具有世界声誉的北京著名菜式，用料为优质肉食鸭北京鸭，果木炭火烤制，色泽红润，肉质肥而不腻。北京烤鸭分为两大流派，而北京最著名的烤鸭店也即是两派的代表。它以色泽红艳，肉质细嫩，味道醇厚，肥而不腻的特色，被誉为“天下美味”而驰名中外。', '');
INSERT INTO `t_o_food` VALUES ('24', 'FOOD174018', '提拉米苏', '糕点', '54', '李厨师', '提拉米苏（Tiramisù），为一种意大利甜点，亦译成堤拉米苏。提拉米苏是一种带咖啡酒味儿的蛋糕，由鲜奶油、可可粉、巧克力、面粉制成，最上面是薄薄的一层可可粉，下面是浓浓的奶油制品，而奶油中间是类似巧克力蛋糕般的慕司。', '');
INSERT INTO `t_o_food` VALUES ('25', 'FOOD018417', '红烧肉', '中餐', '45', '李厨师', '红烧肉是热菜菜谱之一，以五花肉为制作主料，红烧肉的烹饪技巧以砂锅为主，口味属于甜味。红烧肉是一道著名的本帮菜，充分体现了本帮菜“浓油赤酱”的特点。', '');
INSERT INTO `t_o_food` VALUES ('26', 'FOOD713949', '燕窝', '招牌菜', '57', '李厨师', '燕窝又称燕菜、燕根、燕蔬菜，为雨燕科动物金丝燕及多种同属燕类用唾液与绒羽等混合凝结所筑成的巢窝，形似元宝，窝外壁由横条密集的丝状物堆垒成不规则棱状突起，窝内壁由丝状物织成不规则网状，窝碗根却坚实，两端有小坠角，一般直径6~7厘米，深3~4厘米。主要产于我国南海诸岛及东南亚各国。燕窝因采集时间不同可分为三种：1、白燕：古代曾列为贡品，故又称宫燕；2、毛燕；3、血燕。燕窝的营养较高，含50%蛋白质，30%糖类和一些矿物质。是中国传统名贵食品之一。', '');
INSERT INTO `t_o_food` VALUES ('27', 'FOOD473745', '糖醋排骨', '小吃', '67', '李厨师', '糖醋排骨(Sweet and Sour Spare Ribs )是糖醋菜中具有代表性的一道大众喜爱的传统菜，它选用新鲜猪子排作料，肉质鲜嫩，成莱色泽红亮油润，口味香脆酸甜，颇受江南一带食者的欢迎。“糖醋”中国各大菜系都拥有的一种口味。它源于江苏的无锡，在江苏、浙江、四川菜中广为流传，常用于熘菜。', '');
INSERT INTO `t_o_food` VALUES ('28', 'FOOD794751', '鸡蛋炒西红柿', '中餐', '57', '李厨师', '西红柿炒鸡蛋（英文名：Scrambled eggs with tomatoes），主料为西红柿，鸡蛋。此菜口感甚好，红黄相间，鲜香酸甜。营养丰富，常吃具有滋补、美容功效。', '');
INSERT INTO `t_o_food` VALUES ('29', 'FOOD289664', '酸菜鱼', '招牌菜', '47', '李厨师', '酸菜鱼属四川菜系，以其特有的调味和独特的烹调技法而著称。以鲜草鱼为主料，配以四川泡菜煮制而成。此菜虽为四川民间家常菜，但流传甚广。成菜肉质细嫩，汤酸香鲜美，微辣不腻；鱼片嫩黄爽滑。酸菜鱼流行于90年代初，在大大小小的餐馆都有其一席之地，重庆的厨师们又把它推向中国的大江南北，酸菜鱼是重庆菜的开始先锋之一。', '');
INSERT INTO `t_o_food` VALUES ('30', 'FOOD281977', '酸辣土豆丝', '招牌菜', '78', '李厨师', '酸辣土豆丝是一道老百姓餐桌上最常见的家常菜，其主料土豆性平和胃，有改善肠胃功能、预防高血压的功效。辅料辣椒富含维生素C，可增强体力、冠状动脉硬化。该菜用料简单，好学易做，营养丰富，清爽可口，很受人欢迎', '');
INSERT INTO `t_o_food` VALUES ('31', 'FOOD689678', '皮蛋豆腐', '招牌菜', '35', '李厨师', '皮蛋豆腐（Tofu with Preserved Eggs），是采用嫩脂豆腐、榨菜、皮蛋、香油、香菜等原料制作而成美味佳肴，制作简单，营养丰富，富含人体所需的多种营养成分，谈到该菜肴的起源，还有一个美丽的传说，据说与三国时候的关羽有关系。', '');
INSERT INTO `t_o_food` VALUES ('32', 'FOOD083040', '啤酒鸭', '中餐', '70', '李厨师', '啤酒鸭是最常见的家常菜之一，啤酒鸭的做法有很多种。其主料为鸭子、啤酒。啤酒鸭是一道风味独特的佐酒佳肴，是将鸭肉与啤酒一同炖煮成菜，使滋补的鸭肉味道更加浓厚，鸭肉不仅入口鲜香，还带有一股啤酒清香。是深受广大食客喜爱的菜肴。', '');
INSERT INTO `t_o_food` VALUES ('33', 'FOOD012285', '鱼香肉丝', '中餐', '35', '李厨师', '鱼香肉丝是一道常见川菜。鱼香，是四川菜肴主要传统味型之一。成菜具有鱼香味，其味是调味品调制而成。此法源出于四川民间独具特色的烹鱼调味方法，而今已广泛用于川味的熟菜中。', '');
INSERT INTO `t_o_food` VALUES ('34', 'FOOD796857', '回锅肉', '招牌菜', '57', '李厨师', '回锅肉是中国川菜中一种烹调猪肉的传统菜式，川西地区还称之为熬锅肉。四川家家户户都能制作。回锅肉的特点是口味独特，色泽红亮，肥而不腻。所谓回锅，就是再次烹调的意思。回锅肉作为一道传统川菜，在川菜中的地位是非常重要的，川菜考级经常用回锅肉作为首选菜肴。回锅肉一直被认为是川菜之首，川菜之化身，提到川菜必然想到回锅肉。', '');
INSERT INTO `t_o_food` VALUES ('35', 'FOOD535448', '布丁', '西餐', '45', '李厨师', ' 布丁布丁，食物名，英语pudding的译音，亦有称作“布甸”。西餐食品，用面粉、牛奶、鸡蛋、水果等制成。布丁有很多种：鸡蛋布丁、芒果布丁、鲜奶布丁、巧克力布丁、草莓布丁等。布丁不仅看上去美味，吃起来更好，布丁也是果冻的一种。另外布丁也是炎亚纶粉丝的称呼。', '');
INSERT INTO `t_o_food` VALUES ('36', 'FOOD677357', '鱼子酱', '西餐', '35', '李厨师', '鱼子酱（Caviar），又称鱼籽酱，在波斯话中意为鱼卵，严格来说，只有鲟鱼卵才可称为鱼子酱，其中以产于接壤伊朗和俄罗斯的里海的鱼子酱质素最佳。 并非所有鲟鱼卵都可制成鱼子酱，世界范围内共有超过20种的不同鲟鱼，其中只有Beluga、oscietra及Sevruga三品种的鱼卵制成鱼子酱，最高级的Beluga，一年产量不到一百尾，而且要超过六十岁的Beluga才可制作鱼子酱。', '');
INSERT INTO `t_o_food` VALUES ('37', 'FOOD179700', '牛奶', '饮品', '10', '李厨师', '牛奶，是最古老的天然饮料之一。牛奶顾名思义是从雌性奶牛身上所挤出来的。在不同国家，牛奶也分有不同的等级，目前最普遍的是全脂、低脂及脱脂牛奶。目前市面上牛奶的添加物也相当多，如高钙低脂牛奶，就强调其中增添了钙质。', '');
INSERT INTO `t_o_food` VALUES ('38', 'FOOD253832', '鸡尾酒', '饮品', '30', '李厨师', '鸡尾酒是一种量少而冰镇的酒。它是以朗姆酒(RUM)，琴酒(GIN)、龙舌兰（Tequila）伏特加（VODKA）威士忌（Whisky）等烈酒或是葡萄酒作为基酒，再配以果汁、蛋清、苦精（Bitters）、牛奶，咖啡，可可，糖等其他辅助材料，加以搅拌或摇晃而成的一种饮料，最后还可用柠檬片，水果或薄荷叶作为装饰物。', '');
INSERT INTO `t_o_food` VALUES ('39', 'FOOD752631', '伏特加', '饮品', '500', '李厨师', '伏特加（俄文：Водка）是一种经蒸馏处理的酒精饮料。它是由水和经蒸馏净化的乙醇所合成的透明液体，一般更会经多重蒸馏从而达到更纯更美味的效果，市面上品质较好的伏特加一般是经过三重蒸馏的。在蒸馏过程中除水和乙醇外亦会加入马铃薯、菜糖浆及黑麦或小麦，如果是制作有味道的伏特加更会加入适量的调味料。伏特加酒的酒精含量通常由35%到50%不等，传统由俄罗斯，立陶宛和波兰所出产的伏特加酒精含量是以40%为标准。', '');
INSERT INTO `t_o_food` VALUES ('40', 'FOOD951264', '轩尼诗', '饮品', '40', '李厨师', '轩尼诗是法国白兰地的著名品牌之一。世界销量第一，拥有世界规模最大的陈年生命之水蕴藏。始创于一七六五年，轩尼诗秉承其家族对酿制干邑（法国地名，代指白兰地）一丝不苟、力臻完美的优良传统，严格控制生产的每一个环节，并贯彻轩尼诗之原创精神，例如以“星”来划分干邑的等级，就是源自轩尼诗。另外，英国第8任港督的名字，也叫轩尼诗。', '');
INSERT INTO `t_o_food` VALUES ('41', 'FOOD676320', '胡萝卜苹果汁', '饮品', '30', '李厨师', '胡萝卜：胡萝卜能提供丰富的维A，可促进机体正常生长繁殖、维持上皮组织、防止呼吸道感染与保持视力正常、治疗夜盲症和眼干燥症等功能。同时还能增强人体免疫力和抗癌的作用，并可减轻癌症病人的化疗反应，对多种脏器有保护作用。妇女进食胡萝卜可以降低卵巢癌的发病率。另外胡萝卜内所含的琥珀酸钾，有助于防止血管硬化，降低胆固醇，对防治高血压有一定效果。胡萝卜素可清除致人衰老的自由基，所含的B族维生素和维C等也有润皮肤、抗衰老的作用。另外它的芳香气味是挥发油造成的，能增进消化，并有杀菌作用。 　　苹果：苹果酸甜可口，营养价值和食疗价值都很高，被人称为“大夫第一药”、“全方位的健康水果”或“全科医生”。苹果主要含有糖，果胶，有机酸，多种维生素，钙、磷、镁等矿物质，膳食纤维等。苹果中的维生素C是心血管的保护神，胶质和矿物质可以降低胆固醇，特有的香气可以缓解压力过大造成的不良情绪，还有提神醒脑之功。苹果可以养颜除斑，使肌肤润泽有弹性。 ', '');
INSERT INTO `t_o_food` VALUES ('42', 'FOOD634511', '美汁源果粒橙', '饮品', '20', '李厨师', '美汁源是可口可乐公司2004年4月份上市的一个品牌，是全球销量最大的果汁品牌之一。目前，该产品分销100 多个国家。果粒橙，精选每一个产自弗罗里达的阳光香橙，通过全橙深度榨取技术，致力于保留香橙中的营养成分，更一并融入了饱满的阳光果肉，不添加糖、防腐剂和人造色素。', '');
INSERT INTO `t_o_food` VALUES ('43', 'FOOD979834', '蛋挞', '糕点', '30', '李厨师', '蛋挞（Egg Tart），台湾称为蛋塔，挞为英文“tart”之音译，意指馅料外露的馅饼（相对表面被饼皮覆盖馅料密封之批派馅饼pie）；蛋挞即以蛋浆为馅料的“tart”。做法是把饼皮放进小圆盆状的饼模中，倒入由砂糖及鸡蛋混合而成之蛋浆，然后放入烤炉；烤出的蛋挞外层为松脆之挞皮，内层则为香甜的黄色凝固蛋浆。', '');
INSERT INTO `t_o_food` VALUES ('44', 'FOOD215857', '芝士蛋糕', '糕点', '300', '李厨师', '芝士蛋糕，或起司蛋糕、干酪蛋糕，是西方甜点的一种。英文是cheese cake。有着柔软的上层，混合了特殊的芝士，如ricotta cheese，或是cream cheese，再加上糖和其他的配料，如鸡蛋、奶油和水果等。芝士蛋糕通常都以饼干做为底层，亦有不使用底层的，有固定的几种口味，如原味、香草起士蛋糕，巧克力芝士蛋糕等，至于表层加上的装饰，常常是草莓或蓝莓，也有不装饰或是只是在顶层简单抹上一层薄蜂蜜的种类。此类蛋糕在结构上较一般蛋糕扎实，但质地却较一般蛋糕来得绵软，口感上亦较一般蛋糕来得湿润，若以具体事物来描述，芝士蛋糕是口感上类似于提拉米苏或是慕思之类的糕点，但本身又不若两者来得绵软。有时芝士蛋糕看起来不太像一般蛋糕，反而比较像派的一种。', '');
INSERT INTO `t_o_food` VALUES ('45', 'FOOD115041', '海绵蛋糕', '糕点', '30', '李厨师', '在西方，蛋糕是一种具有代表性的西点，倍受人们的钟爱。目前在我国，蛋糕也作为一种老少皆宜、四季应时的食品，正逐渐走进了千家万户。', '');
INSERT INTO `t_o_food` VALUES ('46', 'FOOD523107', '遵义鸡蛋糕', '糕点', '60', '李厨师', '历史名城遵义，有很多地方名特产食品，其中小鸡蛋糕算是最有名气的一种，100多年来成为遵义的一大名点。凡到遵义的人都要买上几包带回家吃或馈赠亲友，吃过的人都说：“遵义鸡蛋糕有特色，比起其他鸡蛋糕好吃”。', '');
INSERT INTO `t_o_food` VALUES ('47', 'FOOD976444', '草粿', '小吃', '11', '李厨师', '草粿是用一种叫草粿草的干草熬汁，加入少许地瓜粉，使其凝结，装在小缸中用盖盖好。挑卖时一头是碗筷架和红糖，架下放洗碗水；一头是小缸。卖时以铜匙从草粿的上层切出于碗中，加撒糖粉，还点上一滴橙膏。潮阳、普宁农村卖草粿，则以一个多孔的铜钱刨，将缸钵里的凝结草粿刨起，成为条状，加进红糖，温吃或冷吃皆可。吃草粿能解暑，但不可留过夜。如遇雨天，人家则不吃。潮语有一句俗语，叫“草粿煮熟，天时变局”。形容时令变化，生意倒霉。', '');
INSERT INTO `t_o_food` VALUES ('48', 'FOOD028789', '鸭母捻', '小吃', '10', '李厨师', '传统名小食，首创于清代初年，原名为糯米汤圆，现以潮州市太平路尾传统名店胡荣泉制作的鸭母捻最为正宗。鸭母捻类似北方的汤圆，传统制作要求严格。鸭母捻的馅有四样，即绿豆馅、红豆沙、芋泥、芝麻糖，每粒的馅约15克。鸭母捻放在白糖水中煮至浮上水面即熟。传统卖鸭母捻每碗三粒，每粒的馅各不相同，为区分每粒馅的不同，在包的时候，不同馅的鸭母捻形状各异，如有的形状略圆、有的略尖等，各有记号。', '');
INSERT INTO `t_o_food` VALUES ('49', 'FOOD024602', '绿豆糕', '小吃', '20', '李厨师', '汕樟林古港，是明清年代“红头船”的“通洋总汇之地”。每逢中秋佳节，千家万户手巧艺妙的贤慧妇女，常喜爱加工制作美食糕点———绿豆糕，其传统技术工艺和加工制作方法考究，蒸熟后金碧晶莹，入口清香甜美，风味独特，既是一味适合时令的可口药膳糕点，又是樟林饮食文化独创的一种营养丰富的美食，堪称是潮汕地区中秋糕点的佼佼者。', '');
INSERT INTO `t_o_food` VALUES ('62', 'FOOD980349', '鼠曲粿', '小吃', '13', '李厨师', '传统的潮汕妇女都会做糕粿，每到农历新年更不忘制作鼠曲粿(“鼠曲”的潮汕话谐音是“鼠壳”，本地人因此称之为鼠壳粿)。鼠壳粿通常只在农历新年时应节制作，所以潮汕人又把它叫做年粿。', '');
INSERT INTO `t_o_food` VALUES ('63', 'FOOD467762', '老妈宫粽球', '小吃', '25', '李厨师', '老妈宫粽球指汕头市升平路头妈祖宫(即老妈宫)附近的顺德号的粽球。由于粽是用竹叶包裹，要打开吃了才知道味道，于是有此俗语。喻事久见人心。由于潮人有五月初五端午节吃粽子、赛龙舟的习俗。而且在南方过了端午节，气候开始转热，故俗语中还有“五月未食粽，破裘唔敢放”的谚语。', '');
INSERT INTO `t_o_food` VALUES ('64', 'FOOD473620', '潮汕蚝烙', '小吃', '25', '李厨师', '蚝烙是潮汕的特有小食，外地人来潮汕总要尝一尝这一美食。市镇酒店、小食店多有这种小食，“西天巷蚝烙”是汕头名小食之一。蚝有助于明目，又滑润可口，蚝烙又能热胃，寒天人们更喜欢吃。', '');
INSERT INTO `t_o_food` VALUES ('65', 'FOOD115962', '春饼', '小吃', '25', '李厨师', '原是立春日的食品，唐宋时称为春盘。清代以后制作上有了改进，其馅料由芹、韭、笋组成，表示勤劳、长久、蓬勃之意。以后成为四时皆备的小食，称为春饼。制作用料逐步改进。现代潮汕春饼的用料和制法：将面料制成的薄饼皮披开，放入用鱼露、味精、胡椒粉、麻油、猪油搅拌均匀的绿豆瓣，猪肉，鲜虾肉，香茹，虾米和蒜茸，包成卷状，用稀面糊粘紧接合处，放入约180℃的油锅炸至呈金黄色。其特点是：外皮酥脆，馅料浓香。', '');
INSERT INTO `t_o_food` VALUES ('66', 'FOOD088037', '达濠鱼丸', '小吃', '26', '李厨师', '精选优质鲜鱼配制，洁白细柔，酥脆清口，方便一般家庭饭店应用。', '');
INSERT INTO `t_o_food` VALUES ('67', 'FOOD067373', '潮汕手拍牛肉丸', '小吃', '12', '李厨师', '选用新鲜的牛腿包肉作料，去筋后切成块，放在大砧板上，用特制的方形锤刀两把(重量3公斤左右)，上下不停地用力把牛腿肉槌成肉浆，加入少量雪粉、精盐、上等鱼露和味精，继续再槌15分钟，随后用大缽盛装，加入方鱼末、白肉粒和味精，拌匀，用手使劲搅挞，至肉浆粘手不掉下为止，然后用手抓肉浆，握紧拳挤成丸，用羹匙掏进温水盆里，再用慢火煮丸约8分钟，捞起牛肉丸。食时用原汤和牛肉丸下锅煮至初沸(煮时水不能太沸，否则牛肉丸不爽滑)，加入适量味精、芝麻油、胡椒粉和芹菜粒，配上沙茶酱或辣椒酱佐食。', '');
INSERT INTO `t_o_food` VALUES ('68', 'FOOD766303', '粿汁', '小吃', '14', '李厨师', '米制品之一。注重辅助料的调配。辅助料用久醇的猪肉卤汁、经腌制卤烂的五花肉和用油煎成金黄色的蒜头粒。', '');
INSERT INTO `t_o_food` VALUES ('69', 'FOOD170131', '翻砂芋', '小吃', '12', '李厨师', '翻砂芋，过去是中秋节的应时食品。芋头去表皮后，切成指状小块，放入油锅中炸熟捞起。隔一会儿，再将芋块放人油中，以除去水汽。然后用白糖加水适量，放入锅中煮，到糖水像胶水一样粘时，即将芋块放入，拌匀捞起，并马上从炉上拿开。', '');
INSERT INTO `t_o_food` VALUES ('70', 'FOOD238361', '潮汕卤鹅', '小吃', '26', '李厨师', '潮汕特产的狮头鹅，肉质肥美，卤鹅是地方风味食品，香滑入味，肥而不腻。', '');
INSERT INTO `t_o_food` VALUES ('71', 'FOOD873589', '酱香鸡翅', '中餐', '45', 'heboxin', '可乐鸡翅，以鸡翅和可乐为主料制作而成。味道鲜美，色泽艳丽，鸡翅嫩滑，咸甜适中，又保留了可乐的香气，深受大众喜欢。\r\n', '');

-- ----------------------------
-- Table structure for `t_o_order`
-- ----------------------------
DROP TABLE IF EXISTS `t_o_order`;
CREATE TABLE `t_o_order` (
  `o_orderId` int(10) NOT NULL AUTO_INCREMENT,
  `o_orderNo` char(10) NOT NULL,
  `o_orderUser` char(15) NOT NULL,
  `o_orderFood` text NOT NULL,
  `o_orderAllprice` float DEFAULT NULL,
  `o_orderRemark` text,
  `o_orderState` char(10) NOT NULL,
  PRIMARY KEY (`o_orderId`),
  UNIQUE KEY `o_orderId` (`o_orderId`)
) ENGINE=InnoDB AUTO_INCREMENT=1070 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_o_order
-- ----------------------------
INSERT INTO `t_o_order` VALUES ('1', 'ORDER20391', '23432', '34234', '34', '343', '完成');
INSERT INTO `t_o_order` VALUES ('2', 'ORDER20392', 'rewr', 'erw', '45', 'er', '完成');
INSERT INTO `t_o_order` VALUES ('4', '5675', '67576', '5675', '76567', '5675', '完成');
INSERT INTO `t_o_order` VALUES ('8', '12321', '567576', '5675', '67567', '5675', '完成');
INSERT INTO `t_o_order` VALUES ('32', 'ORDER90386', 'a123', 'FOOD170131;翻砂芋;3份;36.0元;FOOD766303;粿汁;3份;42.0元;FOOD238361;潮汕卤鹅;2份;52.0元;', '130', '', '完成');
INSERT INTO `t_o_order` VALUES ('33', 'ORDER47370', 'a123', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '完成');
INSERT INTO `t_o_order` VALUES ('34', 'ORDER02667', 'a123', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('35', 'ORDER09706', 'a123', 'FOOD723739;黑脚猪生火腿;1份;73.0元;FOOD018417;红烧肉;2份;90.0元;FOOD684672;北京烤鸭;5份;115.0元;FOOD238361;潮汕卤鹅;2份;52.0元;', '330', '', '未完成');
INSERT INTO `t_o_order` VALUES ('36', 'ORDER20729', 'aaa', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('37', 'ORDER61594', 'a123', 'FOOD723739;黑脚猪生火腿;1份;73.0元;FOOD796857;回锅肉;1份;57.0元;', '130', '', '未完成');
INSERT INTO `t_o_order` VALUES ('38', 'ORDER34496', 'sarah', 'FOOD170131;翻砂芋;1份;12.0元;FOOD766303;粿汁;1份;14.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1038', 'ORDER55518', 'asd', 'FOOD170131;翻砂芋;1份;12.0元;FOOD067373;潮汕手拍牛肉丸;1份;12.0元;', '24', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1039', 'ORDER97961', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1040', 'ORDER73747', 'asd', 'FOOD170131;翻砂芋;1份;12.0元;', '12', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1041', 'ORDER36604', 'asd', 'FOOD088037;达濠鱼丸;1份;26.0元;FOOD238361;潮汕卤鹅;1份;26.0元;', '52', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1042', 'ORDER81646', 'asd', 'FOOD170131;翻砂芋;3份;36.0元;FOOD238361;潮汕卤鹅;555份;14430.0元;', '14466', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1043', 'ORDER34864', 'asd', 'FOOD794751;鸡蛋炒西红柿;1份;57.0元;FOOD684672;北京烤鸭;1份;23.0元;', '80', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1044', 'ORDER38458', 'asd', 'FOOD473745;糖醋排骨;1份;67.0元;', '67', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1045', 'ORDER17936', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1046', 'ORDER10360', 'asd', 'FOOD689678;皮蛋豆腐;1份;35.0元;FOOD264593;蔬菜冷汤;1份;4.0元;FOOD281977;酸辣土豆丝;1份;78.0元;', '117', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1047', 'ORDER04000', 'asd', 'FOOD689678;皮蛋豆腐;2份;70.0元;FOOD796857;回锅肉;2份;114.0元;', '184', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1048', 'ORDER20194', 'asd', 'FOOD170131;翻砂芋;1份;12.0元;FOOD238361;潮汕卤鹅;1份;26.0元;', '38', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1049', 'ORDER50840', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1050', 'ORDER75310', 'asd', 'FOOD766303;粿汁;1份;14.0元;FOOD238361;潮汕卤鹅;1份;26.0元;', '40', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1051', 'ORDER18024', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1052', 'ORDER58860', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1053', 'ORDER98706', 'asd', 'FOOD289664;酸菜鱼;1份;47.0元;', '47', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1054', 'ORDER85359', 'asd', 'FOOD289664;酸菜鱼;1份;47.0元;', '47', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1055', 'ORDER61338', 'asd', 'FOOD238361;潮汕卤鹅;1份;26.0元;', '26', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1056', 'ORDER75942', 'asd', 'FOOD821850;母油船鸭;1份;88.0元;', '88', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1057', 'ORDER78076', 'asd', 'FOOD689678;皮蛋豆腐;1份;35.0元;FOOD235102;香草羊扒;1份;34.0元;FOOD253832;鸡尾酒;1份;30.0元;', '99', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1058', 'ORDER09439', 'asd', 'FOOD012285;鱼香肉丝;1份;35.0元;FOOD692460;肉眼扒;1份;34.0元;FOOD238361;潮汕卤鹅;1份;26.0元;', '95', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1059', 'ORDER58015', 'asd', 'FOOD796857;回锅肉;1份;57.0元;', '57', '', '完成');
INSERT INTO `t_o_order` VALUES ('1060', 'ORDER01425', 'asd', 'FOOD170131;翻砂芋;1份;12.0元;', '12', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1061', 'ORDER57853', 'heboxin', 'FOOD752631;伏特加;1份;500.0元;FOOD264593;蔬菜冷汤;1份;4.0元;FOOD174018;提拉米苏;1份;54.0元;', '558', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1062', 'ORDER26200', 'heboxin', 'FOOD677357;鱼子酱;1份;35.0元;FOOD012285;鱼香肉丝;1份;35.0元;', '70', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1063', 'ORDER10771', 'asd', 'FOOD873589;酱香鸡翅;1份;45.0元;', '45', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1064', 'ORDER95068', 'asd', 'FOOD873589;酱香鸡翅;1份;45.0元;', '45', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1066', 'ORDER95068', 'asd', 'FOOD873589;酱香鸡翅;1份;45.0元;', '45', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1067', 'ORDER95068', 'asd', 'FOOD873589;酱香鸡翅;1份;45.0元;', '45', '', '未完成');
INSERT INTO `t_o_order` VALUES ('1068', 'ORDER50969', 'asd', 'FOOD873589;酱香鸡翅;1份;45.0元;', '45', '', '未完成');

-- ----------------------------
-- Table structure for `t_o_user`
-- ----------------------------
DROP TABLE IF EXISTS `t_o_user`;
CREATE TABLE `t_o_user` (
  `o_userId` int(10) NOT NULL AUTO_INCREMENT,
  `o_userName` char(15) NOT NULL,
  `o_userPwd` char(15) NOT NULL,
  `o_userNaickname` char(15) NOT NULL,
  `o_userBirthday` datetime NOT NULL,
  `o_userSex` char(10) NOT NULL,
  `o_userTruename` char(15) NOT NULL,
  `o_userIdcard` char(20) NOT NULL,
  `o_userPhone` char(255) DEFAULT NULL,
  `o_userEmail` char(255) NOT NULL,
  `o_userImg` char(10) DEFAULT NULL,
  UNIQUE KEY `o_userId` (`o_userId`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_o_user
-- ----------------------------
INSERT INTO `t_o_user` VALUES ('9', 'a123', '123', '撒旦', '1999-08-09 00:00:00', '男', '7987', 'aaa', '111', '111', 'user5');
INSERT INTO `t_o_user` VALUES ('12', '5673', '576', '567', '1888-09-09 00:00:00', '65', '675', '675', '675', '765', 'user8');
INSERT INTO `t_o_user` VALUES ('13', '576', '22222', '576', '1888-09-09 00:00:00', '7657', '65', '765', '675', '765', 'user8');
INSERT INTO `t_o_user` VALUES ('14', '234', '234', '234', '1888-09-09 00:00:00', '76', '765', '675', '675', '675', 'user8');
INSERT INTO `t_o_user` VALUES ('15', '111', '222', '333', '1889-09-09 00:00:00', '555', '666', '777', '888', '999', '0000');
INSERT INTO `t_o_user` VALUES ('16', '123123123', '123', '鑹句粈椤?', '1999-09-09 00:00:00', '鐢?', '鎾掓棪', '123', '123', '123', 'user6');
INSERT INTO `t_o_user` VALUES ('17', 'yoyo chen', '5301268', 'yoyo', '1988-10-18 00:00:00', '濂?', 'yoyo', '1234567890', '674747', '516820549', 'user9');
INSERT INTO `t_o_user` VALUES ('18', 'as123', '123', '哈哈', '1988-09-09 00:00:00', '男', 'é????o', '123', '123', '123', 'user5');
INSERT INTO `t_o_user` VALUES ('19', 'asd', 'asd', '撒旦', '1999-09-09 00:00:00', '??·', '???è?2è°?', '123', '123', '123', 'user1');
INSERT INTO `t_o_user` VALUES ('20', 'qwe', 'qwe', '嘎嘎', '1770-09-09 00:00:00', '男', '身份', '123', '123', '123', 'user1');
INSERT INTO `t_o_user` VALUES ('21', 'aaa', '123', '烧豆腐', '1989-09-09 00:00:00', '男', '速度', '123', '123', '123', 'user1');
INSERT INTO `t_o_user` VALUES ('22', 'heboxin', '19931024', '123', '1993-10-24 00:00:00', '男', '11', '1111', '', '111@qq.com', 'user7');
INSERT INTO `t_o_user` VALUES ('23', 'heboxin', '123456', '123', '1993-10-24 00:00:00', '男', '贺博欣', '610103199310242419', '', '111@qq.com', 'user7');
INSERT INTO `t_o_user` VALUES ('24', 'sarah', '1994', 'sarah', '1994-02-20 00:00:00', '女', '李', '140222', '', '22222@qq.com', 'user1');
